let cities = [{id: 1, coords: [121.487899486, 31.24916171], province: "上海", city: "上海市"}, {
  id: 2,
  coords: [100.092612914, 23.8878061038],
  province: "云南省",
  city: "临沧市"
}, {id: 3, coords: [100.229628399, 26.8753510895], province: "云南省", city: "丽江市"}, {
  id: 4,
  coords: [99.1779956133, 25.1204891962],
  province: "云南省",
  city: "保山市"
}, {id: 5, coords: [100.223674789, 25.5968996394], province: "云南省", city: "大理白族自治州"}, {
  id: 6,
  coords: [98.5894342874, 24.441239663],
  province: "云南省",
  city: "德宏傣族景颇族自治州"
}, {id: 7, coords: [98.8599320425, 25.8606769782], province: "云南省", city: "怒江傈僳族自治州"}, {
  id: 8,
  coords: [104.246294318, 23.3740868504],
  province: "云南省",
  city: "文山壮族苗族自治州"
}, {id: 9, coords: [102.714601139, 25.0491531005], province: "云南省", city: "昆明市"}, {
  id: 10,
  coords: [103.725020656, 27.3406329636],
  province: "云南省",
  city: "昭通市"
}, {id: 11, coords: [100.98005773, 22.7887777801], province: "云南省", city: "普洱市"}, {
  id: 12,
  coords: [103.782538888, 25.5207581429],
  province: "云南省",
  city: "曲靖市"
}, {id: 13, coords: [101.529382239, 25.0663556742], province: "云南省", city: "楚雄彝族自治州"}, {
  id: 14,
  coords: [102.545067892, 24.3704471344],
  province: "云南省",
  city: "玉溪市"
}, {id: 15, coords: [103.384064757, 23.3677175165], province: "云南省", city: "红河哈尼族彝族自治州"}, {
  id: 16,
  coords: [100.803038275, 22.0094330022],
  province: "云南省",
  city: "西双版纳傣族自治州"
}, {id: 17, coords: [99.7136815989, 27.8310294612], province: "云南省", city: "迪庆藏族自治州"}, {
  id: 18,
  coords: [113.112846391, 41.0223629468],
  province: "内蒙古自治区",
  city: "乌兰察布市"
}, {id: 19, coords: [106.831999097, 39.6831770068], province: "内蒙古自治区", city: "乌海市"}, {
  id: 20,
  coords: [122.048166514, 46.0837570652],
  province: "内蒙古自治区",
  city: "兴安盟"
}, {id: 21, coords: [109.846238532, 40.6471194257], province: "内蒙古自治区", city: "包头市"}, {
  id: 22,
  coords: [119.760821794, 49.2016360546],
  province: "内蒙古自治区",
  city: "呼伦贝尔市"
}, {id: 23, coords: [111.66035052, 40.8283188731], province: "内蒙古自治区", city: "呼和浩特市"}, {
  id: 24,
  coords: [107.42380672, 40.7691799024],
  province: "内蒙古自治区",
  city: "巴彦淖尔市"
}, {id: 25, coords: [118.930761192, 42.2971123203], province: "内蒙古自治区", city: "赤峰市"}, {
  id: 26,
  coords: [122.260363263, 43.633756073],
  province: "内蒙古自治区",
  city: "通辽市"
}, {id: 27, coords: [109.993706251, 39.8164895606], province: "内蒙古自治区", city: "鄂尔多斯市"}, {
  id: 28,
  coords: [116.027339689, 43.9397048423],
  province: "内蒙古自治区",
  city: "锡林郭勒盟"
}, {id: 29, coords: [105.695682871, 38.8430752644], province: "内蒙古自治区", city: "阿拉善盟"}, {
  id: 30,
  coords: [116.395645038, 39.9299857781],
  province: "北京",
  city: "北京市"
}, {id: 31, coords: [119.337634104, 26.0911937119], province: "台湾省", city: "台中市"}, {
  id: 32,
  coords: [114.130474436, 22.3748329286],
  province: "台湾省",
  city: "台北市"
}, {id: 33, coords: [121.360525873, 38.9658447898], province: "台湾省", city: "台南市"}, {
  id: 34,
  coords: [114.246701335, 22.7288657203],
  province: "台湾省",
  city: "嘉义市"
}, {id: 38, coords: [111.590952812, 21.9464822541], province: "台湾省", city: "高雄市"}, {
  id: 39,
  coords: [126.564543989, 43.8719883344],
  province: "吉林省",
  city: "吉林市"
}, {id: 40, coords: [124.391382074, 43.1755247011], province: "吉林省", city: "四平市"}, {
  id: 41,
  coords: [129.485901958, 42.8964136037],
  province: "吉林省",
  city: "延边朝鲜族自治州"
}, {id: 42, coords: [124.832994532, 45.1360489701], province: "吉林省", city: "松原市"}, {
  id: 43,
  coords: [122.840776679, 45.6210862752],
  province: "吉林省",
  city: "白城市"
}, {id: 44, coords: [126.435797675, 41.945859397], province: "吉林省", city: "白山市"}, {
  id: 45,
  coords: [125.133686052, 42.9233026191],
  province: "吉林省",
  city: "辽源市"
}, {id: 46, coords: [125.942650139, 41.7363971299], province: "吉林省", city: "通化市"}, {
  id: 47,
  coords: [125.313642427, 43.8983376071],
  province: "吉林省",
  city: "长春市"
}, {id: 48, coords: [103.760824239, 29.6009576111], province: "四川省", city: "乐山市"}, {
  id: 49,
  coords: [105.073055992, 29.5994615348],
  province: "四川省",
  city: "内江市"
}, {id: 50, coords: [102.259590803, 27.8923929037], province: "四川省", city: "凉山彝族自治州"}, {
  id: 51,
  coords: [106.105553984, 30.8009651682],
  province: "四川省",
  city: "南充市"
}, {id: 52, coords: [104.633019062, 28.7696747963], province: "四川省", city: "宜宾市"}, {
  id: 53,
  coords: [106.757915842, 31.8691891592],
  province: "四川省",
  city: "巴中市"
}, {id: 54, coords: [105.81968694, 32.4410401584], province: "四川省", city: "广元市"}, {
  id: 55,
  coords: [106.635720331, 30.4639838879],
  province: "四川省",
  city: "广安市"
}, {id: 56, coords: [104.402397818, 31.1311396527], province: "四川省", city: "德阳市"}, {
  id: 57,
  coords: [104.067923463, 30.6799428454],
  province: "四川省",
  city: "成都市"
}, {id: 58, coords: [101.722423152, 26.5875712571], province: "四川省", city: "攀枝花市"}, {
  id: 59,
  coords: [105.443970289, 28.8959298039],
  province: "四川省",
  city: "泸州市"
}, {id: 60, coords: [101.969232063, 30.0551441144], province: "四川省", city: "甘孜藏族自治州"}, {
  id: 61,
  coords: [103.841429563, 30.0611150799],
  province: "四川省",
  city: "眉山市"
}, {id: 62, coords: [104.705518975, 31.5047012581], province: "四川省", city: "绵阳市"}, {
  id: 63,
  coords: [104.776071339, 29.3591568895],
  province: "四川省",
  city: "自贡市"
}, {id: 64, coords: [104.635930302, 30.132191434], province: "四川省", city: "资阳市"}, {
  id: 65,
  coords: [107.494973447, 31.2141988589],
  province: "四川省",
  city: "达州市"
}, {id: 66, coords: [105.564887792, 30.5574913504], province: "四川省", city: "遂宁市"}, {
  id: 67,
  coords: [102.228564689, 31.9057628583],
  province: "四川省",
  city: "阿坝藏族羌族自治州"
}, {id: 68, coords: [103.009356466, 29.9997163371], province: "四川省", city: "雅安市"}, {
  id: 69,
  coords: [117.210813092, 39.1439299033],
  province: "天津",
  city: "天津市"
}, {id: 70, coords: [105.196754199, 37.5211241916], province: "宁夏回族自治区", city: "中卫市"}, {
  id: 71,
  coords: [106.208254199, 37.9935610029],
  province: "宁夏回族自治区",
  city: "吴忠市"
}, {id: 72, coords: [106.285267996, 36.0215234807], province: "宁夏回族自治区", city: "固原市"}, {
  id: 73,
  coords: [106.379337202, 39.0202232836],
  province: "宁夏回族自治区",
  city: "石嘴山市"
}, {id: 74, coords: [106.206478608, 38.5026210119], province: "宁夏回族自治区", city: "银川市"}, {
  id: 75,
  coords: [115.787928245, 33.8712105653],
  province: "安徽省",
  city: "亳州市"
}, {id: 76, coords: [116.505252683, 31.7555583552], province: "安徽省", city: "六安市"}, {
  id: 77,
  coords: [117.282699092, 31.8669422607],
  province: "安徽省",
  city: "合肥市"
}, {id: 78, coords: [117.058738772, 30.5378978174], province: "安徽省", city: "安庆市"}, {
  id: 79,
  coords: [118.752096311, 30.9516423543],
  province: "安徽省",
  city: "宣城市"
}, {id: 80, coords: [116.988692412, 33.6367723858], province: "安徽省", city: "宿州市"}, {
  id: 81,
  coords: [117.494476772, 30.6600192482],
  province: "安徽省",
  city: "池州市"
}, {id: 82, coords: [116.791447429, 33.9600233054], province: "安徽省", city: "淮北市"}, {
  id: 83,
  coords: [117.018638863, 32.6428118237],
  province: "安徽省",
  city: "淮南市"
}, {id: 84, coords: [118.324570351, 32.3173505954], province: "安徽省", city: "滁州市"}, {
  id: 85,
  coords: [118.384108423, 31.3660197875],
  province: "安徽省",
  city: "芜湖市"
}, {id: 86, coords: [117.357079866, 32.9294989067], province: "安徽省", city: "蚌埠市"}, {
  id: 87,
  coords: [117.819428729, 30.9409296947],
  province: "安徽省",
  city: "铜陵市"
}, {id: 88, coords: [115.820932259, 32.9012113306], province: "安徽省", city: "阜阳市"}, {
  id: 89,
  coords: [118.515881847, 31.6885281589],
  province: "安徽省",
  city: "马鞍山市"
}, {id: 90, coords: [118.293569632, 29.7344348562], province: "安徽省", city: "黄山市"}, {
  id: 91,
  coords: [118.583926333, 37.4871211553],
  province: "山东省",
  city: "东营市"
}, {id: 92, coords: [118.340768237, 35.0724090744], province: "山东省", city: "临沂市"}, {
  id: 93,
  coords: [122.093958366, 37.5287870813],
  province: "山东省",
  city: "威海市"
}, {id: 94, coords: [116.328161364, 37.4608259263], province: "山东省", city: "德州市"}, {
  id: 95,
  coords: [119.507179943, 35.4202251931],
  province: "山东省",
  city: "日照市"
}, {id: 96, coords: [117.279305383, 34.8078830784], province: "山东省", city: "枣庄市"}, {
  id: 97,
  coords: [117.089414917, 36.1880777589],
  province: "山东省",
  city: "泰安市"
}, {id: 98, coords: [117.024967066, 36.6827847272], province: "山东省", city: "济南市"}, {
  id: 99,
  coords: [116.600797625, 35.4021216643],
  province: "山东省",
  city: "济宁市"
}, {id: 100, coords: [118.059134278, 36.8046848542], province: "山东省", city: "淄博市"}, {
  id: 101,
  coords: [117.968292415, 37.4053139418],
  province: "山东省",
  city: "滨州市"
}, {id: 102, coords: [119.142633823, 36.7161148731], province: "山东省", city: "潍坊市"}, {
  id: 103,
  coords: [121.30955503, 37.5365615629],
  province: "山东省",
  city: "烟台市"
}, {id: 104, coords: [115.986869139, 36.4558285147], province: "山东省", city: "聊城市"}, {
  id: 105,
  coords: [117.684666912, 36.2336541336],
  province: "山东省",
  city: "莱芜市"
}, {id: 106, coords: [115.463359775, 35.2624404961], province: "山东省", city: "菏泽市"}, {
  id: 107,
  coords: [120.384428184, 36.1052149013],
  province: "山东省",
  city: "青岛市"
}, {id: 108, coords: [111.538787596, 36.0997454436], province: "山西省", city: "临汾市"}, {
  id: 109,
  coords: [111.143156602, 37.527316097],
  province: "山西省",
  city: "吕梁市"
}, {id: 110, coords: [113.290508673, 40.1137444997], province: "山西省", city: "大同市"}, {
  id: 111,
  coords: [112.550863589, 37.890277054],
  province: "山西省",
  city: "太原市"
}, {id: 112, coords: [112.727938829, 38.461030573], province: "山西省", city: "忻州市"}, {
  id: 113,
  coords: [112.7385144, 37.6933615268],
  province: "山西省",
  city: "晋中市"
}, {id: 114, coords: [112.867332758, 35.4998344672], province: "山西省", city: "晋城市"}, {
  id: 115,
  coords: [112.479927727, 39.3376719662],
  province: "山西省",
  city: "朔州市"
}, {id: 116, coords: [111.006853653, 35.0388594798], province: "山西省", city: "运城市"}, {
  id: 117,
  coords: [113.120292086, 36.2016643857],
  province: "山西省",
  city: "长治市"
}, {id: 118, coords: [113.569237602, 37.8695294932], province: "山西省", city: "阳泉市"}, {
  id: 119,
  coords: [113.763433991, 23.0430238154],
  province: "广东省",
  city: "东莞市"
}, {id: 120, coords: [113.422060021, 22.5451775145], province: "广东省", city: "中山市"}, {
  id: 121,
  coords: [112.050945959, 22.9379756855],
  province: "广东省",
  city: "云浮市"
}, {id: 122, coords: [113.134025635, 23.0350948405], province: "广东省", city: "佛山市"}, {
  id: 123,
  coords: [113.307649675, 23.1200491021],
  province: "广东省",
  city: "广州市"
}, {id: 124, coords: [114.41065808, 23.1135398524], province: "广东省", city: "惠州市"}, {
  id: 125,
  coords: [116.379500855, 23.5479994669],
  province: "广东省",
  city: "揭阳市"
}, {id: 126, coords: [116.126403098, 24.304570606], province: "广东省", city: "梅州市"}, {
  id: 127,
  coords: [116.728650288, 23.3839084533],
  province: "广东省",
  city: "汕头市"
}, {id: 128, coords: [115.372924289, 22.7787305002], province: "广东省", city: "汕尾市"}, {
  id: 129,
  coords: [113.078125341, 22.5751167835],
  province: "广东省",
  city: "江门市"
}, {id: 130, coords: [114.713721476, 23.7572508505], province: "广东省", city: "河源市"}, {
  id: 131,
  coords: [114.025973657, 22.5460535462],
  province: "广东省",
  city: "深圳市"
}, {id: 132, coords: [113.040773349, 23.6984685504], province: "广东省", city: "清远市"}, {
  id: 133,
  coords: [110.365067263, 21.2574631038],
  province: "广东省",
  city: "湛江市"
}, {id: 134, coords: [116.630075991, 23.6618116765], province: "广东省", city: "潮州市"}, {
  id: 135,
  coords: [113.562447026, 22.2569146461],
  province: "广东省",
  city: "珠海市"
}, {id: 136, coords: [112.47965337, 23.0786632829], province: "广东省", city: "肇庆市"}, {
  id: 137,
  coords: [110.931245331, 21.6682257188],
  province: "广东省",
  city: "茂名市"
}, {id: 138, coords: [111.977009756, 21.8715173045], province: "广东省", city: "阳江市"}, {
  id: 139,
  coords: [113.594461107, 24.8029603119],
  province: "广东省",
  city: "韶关市"
}, {id: 140, coords: [109.122627919, 21.472718235], province: "广西壮族自治区", city: "北海市"}, {
  id: 141,
  coords: [108.297233556, 22.8064929356],
  province: "广西壮族自治区",
  city: "南宁市"
}, {id: 142, coords: [107.357322038, 22.4154552965], province: "广西壮族自治区", city: "崇左市"}, {
  id: 143,
  coords: [109.231816505, 23.7411659265],
  province: "广西壮族自治区",
  city: "来宾市"
}, {id: 144, coords: [109.42240181, 24.3290533525], province: "广西壮族自治区", city: "柳州市"}, {
  id: 145,
  coords: [110.260920147, 25.262901246],
  province: "广西壮族自治区",
  city: "桂林市"
}, {id: 146, coords: [111.30547195, 23.4853946367], province: "广西壮族自治区", city: "梧州市"}, {
  id: 147,
  coords: [108.069947709, 24.6995207829],
  province: "广西壮族自治区",
  city: "河池市"
}, {id: 148, coords: [110.151676316, 22.6439736084], province: "广西壮族自治区", city: "玉林市"}, {
  id: 149,
  coords: [106.631821404, 23.9015123679],
  province: "广西壮族自治区",
  city: "百色市"
}, {id: 150, coords: [109.613707557, 23.1033731644], province: "广西壮族自治区", city: "贵港市"}, {
  id: 151,
  coords: [111.552594179, 24.4110535471],
  province: "广西壮族自治区",
  city: "贺州市"
}, {id: 152, coords: [108.638798056, 21.9733504653], province: "广西壮族自治区", city: "钦州市"}, {
  id: 153,
  coords: [108.351791153, 21.6173984705],
  province: "广西壮族自治区",
  city: "防城港市"
}, {id: 154, coords: [87.5649877411, 43.8403803472], province: "新疆维吾尔自治区", city: "乌鲁木齐市"}, {
  id: 155,
  coords: [81.2978535304, 43.9222480963],
  province: "新疆维吾尔自治区",
  city: "伊犁哈萨克自治州"
}, {id: 156, coords: [76.1375644775, 39.7503455778], province: "新疆维吾尔自治区", city: "克孜勒苏柯尔克孜自治州"}, {
  id: 157,
  coords: [84.8811801861, 45.5943310667],
  province: "新疆维吾尔自治区",
  city: "克拉玛依市"
}, {id: 158, coords: [82.0524362672, 44.9136513743], province: "新疆维吾尔自治区", city: "博尔塔拉蒙古自治州"}, {
  id: 159,
  coords: [89.1815948657, 42.9604700169],
  province: "新疆维吾尔自治区",
  city: "吐鲁番"
}, {id: 160, coords: [79.9302386372, 37.1167744927], province: "新疆维吾尔自治区", city: "和田"}, {
  id: 161,
  coords: [93.5283550928, 42.8585963324],
  province: "新疆维吾尔自治区",
  city: "哈密"
}, {id: 162, coords: [75.9929732675, 39.4706271887], province: "新疆维吾尔自治区", city: "喀什"}, {
  id: 163,
  coords: [82.9748805837, 46.7586836297],
  province: "新疆维吾尔自治区",
  city: "塔城"
}, {id: 165, coords: [87.2960381257, 44.0070578985], province: "新疆维吾尔自治区", city: "昌吉回族自治州"}, {
  id: 167,
  coords: [80.2698461793, 41.1717309015],
  province: "新疆维吾尔自治区",
  city: "阿克苏"
}, {
  id: 168,
  coords: [88.1379154871, 47.8397444862],
  province: "新疆维吾尔自治区",
  city: "阿勒泰"
}, {id: 169, coords: [118.778074408, 32.0572355018], province: "江苏省", city: "南京市"}, {
  id: 170,
  coords: [120.873800951, 32.0146645408],
  province: "江苏省",
  city: "南通市"
}, {id: 171, coords: [118.296893379, 33.9520497337], province: "江苏省", city: "宿迁市"}, {
  id: 172,
  coords: [119.981861013, 31.7713967447],
  province: "江苏省",
  city: "常州市"
}, {id: 173, coords: [117.188106623, 34.2715534311], province: "江苏省", city: "徐州市"}, {
  id: 174,
  coords: [119.427777551, 32.4085052546],
  province: "江苏省",
  city: "扬州市"
}, {id: 175, coords: [120.305455901, 31.5700374519], province: "江苏省", city: "无锡市"}, {
  id: 176,
  coords: [119.919606016, 32.4760532748],
  province: "江苏省",
  city: "泰州市"
}, {id: 177, coords: [119.030186365, 33.6065127393], province: "江苏省", city: "淮安市"}, {
  id: 178,
  coords: [120.148871818, 33.3798618771],
  province: "江苏省",
  city: "盐城市"
}, {id: 179, coords: [120.619907115, 31.317987368], province: "江苏省", city: "苏州市"}, {
  id: 180,
  coords: [119.173872217, 34.601548967],
  province: "江苏省",
  city: "连云港市"
}, {id: 181, coords: [119.455835405, 32.2044094436], province: "江苏省", city: "镇江市"}, {
  id: 182,
  coords: [117.955463877, 28.4576225539],
  province: "江西省",
  city: "上饶市"
}, {id: 183, coords: [115.999848022, 29.7196395261], province: "江西省", city: "九江市"}, {
  id: 184,
  coords: [115.893527546, 28.6895780001],
  province: "江西省",
  city: "南昌市"
}, {id: 185, coords: [114.992038711, 27.1138476502], province: "江西省", city: "吉安市"}, {
  id: 186,
  coords: [114.400038672, 27.8111298958],
  province: "江西省",
  city: "宜春市"
}, {id: 187, coords: [116.360918867, 27.9545451703], province: "江西省", city: "抚州市"}, {
  id: 188,
  coords: [114.947117417, 27.8223215586],
  province: "江西省",
  city: "新余市"
}, {id: 189, coords: [117.186522625, 29.3035627684], province: "江西省", city: "景德镇市"}, {
  id: 190,
  coords: [113.859917033, 27.639544223],
  province: "江西省",
  city: "萍乡市"
}, {id: 191, coords: [114.935909079, 25.8452955363], province: "江西省", city: "赣州市"}, {
  id: 192,
  coords: [117.035450186, 28.2413095972],
  province: "江西省",
  city: "鹰潭市"
}, {id: 193, coords: [115.494810169, 38.886564548], province: "河北省", city: "保定市"}, {
  id: 194,
  coords: [118.183450598, 39.6505309225],
  province: "河北省",
  city: "唐山市"
}, {id: 195, coords: [116.703602223, 39.5186106251], province: "河北省", city: "廊坊市"}, {
  id: 196,
  coords: [114.89378153, 40.8111884911],
  province: "河北省",
  city: "张家口市"
}, {id: 197, coords: [117.933822456, 40.9925210525], province: "河北省", city: "承德市"}, {
  id: 198,
  coords: [116.863806476, 38.2976153503],
  province: "河北省",
  city: "沧州市"
}, {id: 199, coords: [114.522081844, 38.0489583146], province: "河北省", city: "石家庄市"}, {
  id: 200,
  coords: [119.604367616, 39.9454615659],
  province: "河北省",
  city: "秦皇岛市"
}, {id: 201, coords: [115.686228653, 37.7469290459], province: "河北省", city: "衡水市"}, {
  id: 202,
  coords: [114.520486813, 37.0695311969],
  province: "河北省",
  city: "邢台市"
}, {id: 203, coords: [114.482693932, 36.6093079285], province: "河北省", city: "邯郸市"}, {
  id: 204,
  coords: [111.181262093, 34.7833199411],
  province: "河南省",
  city: "三门峡市"
}, {id: 205, coords: [114.085490993, 32.1285823075], province: "河南省", city: "信阳市"}, {
  id: 206,
  coords: [112.542841901, 33.0114195691],
  province: "河南省",
  city: "南阳市"
}, {id: 207, coords: [114.654101942, 33.6237408181], province: "河南省", city: "周口市"}, {
  id: 208,
  coords: [115.641885688, 34.4385886402],
  province: "河南省",
  city: "商丘市"
}, {id: 209, coords: [114.351806508, 36.1102667222], province: "河南省", city: "安阳市"}, {
  id: 210,
  coords: [113.300848978, 33.7453014565],
  province: "河南省",
  city: "平顶山市"
}, {id: 211, coords: [114.351642118, 34.8018541758], province: "河南省", city: "开封市"}, {
  id: 212,
  coords: [113.912690161, 35.3072575577],
  province: "河南省",
  city: "新乡市"
}, {id: 213, coords: [112.447524769, 34.6573678177], province: "河南省", city: "洛阳市"}, {
  id: 214,
  coords: [114.0460614, 33.5762786885],
  province: "河南省",
  city: "漯河市"
}, {id: 215, coords: [115.026627441, 35.7532978882], province: "河南省", city: "濮阳市"}, {
  id: 216,
  coords: [113.211835885, 35.234607555],
  province: "河南省",
  city: "焦作市"
}, {
  id: 218,
  coords: [113.83531246, 34.0267395887],
  province: "河南省",
  city: "许昌市"
}, {id: 219, coords: [113.64964385, 34.7566100641], province: "河南省", city: "郑州市"}, {
  id: 220,
  coords: [114.049153547, 32.9831581541],
  province: "河南省",
  city: "驻马店市"
}, {id: 221, coords: [114.297769838, 35.7554258742], province: "河南省", city: "鹤壁市"}, {
  id: 222,
  coords: [119.929575843, 28.4562995521],
  province: "浙江省",
  city: "丽水市"
}, {id: 223, coords: [121.440612936, 28.6682832857], province: "浙江省", city: "台州市"}, {
  id: 224,
  coords: [120.760427699, 30.7739922396],
  province: "浙江省",
  city: "嘉兴市"
}, {id: 225, coords: [121.579005973, 29.8852589659], province: "浙江省", city: "宁波市"}, {
  id: 226,
  coords: [120.219375416, 30.2592444615],
  province: "浙江省",
  city: "杭州市"
}, {id: 227, coords: [120.690634734, 28.002837594], province: "浙江省", city: "温州市"}, {
  id: 228,
  coords: [120.137243163, 30.8779251557],
  province: "浙江省",
  city: "湖州市"
}, {id: 229, coords: [120.592467386, 30.0023645805], province: "浙江省", city: "绍兴市"}, {
  id: 230,
  coords: [122.169872098, 30.0360103026],
  province: "浙江省",
  city: "舟山市"
}, {id: 231, coords: [118.875841652, 28.9569104475], province: "浙江省", city: "衢州市"}, {
  id: 232,
  coords: [119.652575704, 29.1028991054],
  province: "浙江省",
  city: "金华市"
}, {id: 233, coords: [109.522771281, 18.2577759149], province: "海南省", city: "三亚市"}, {
  id: 234,
  coords: [112.350383075, 16.840062894],
  province: "海南省",
  city: "三沙市"
}, {id: 235, coords: [110.330801848, 20.022071277], province: "海南省", city: "海口市"}, {
  id: 237,
  coords: [110.801228917, 32.6369943395],
  province: "湖北省",
  city: "十堰市"
}, {
  id: 238,
  coords: [114.300060592, 29.8806567577],
  province: "湖北省",
  city: "咸宁市"
}, {id: 239, coords: [113.935734392, 30.9279547842], province: "湖北省", city: "孝感市"}, {
  id: 240,
  coords: [111.310981092, 30.732757818],
  province: "湖北省",
  city: "宜昌市"
}, {id: 241, coords: [109.491923304, 30.2858883166], province: "湖北省", city: "恩施土家族苗族自治州"}, {
  id: 242,
  coords: [114.316200103, 30.5810841269],
  province: "湖北省",
  city: "武汉市"
}, {
  id: 244,
  coords: [112.241865807, 30.332590523],
  province: "湖北省",
  city: "荆州市"
}, {id: 245, coords: [112.217330299, 31.0426112029], province: "湖北省", city: "荆门市"}, {
  id: 246,
  coords: [112.250092848, 32.2291685915],
  province: "湖北省",
  city: "襄阳市"
}, {id: 247, coords: [114.895594041, 30.3844393228], province: "湖北省", city: "鄂州市"}, {
  id: 248,
  coords: [113.379358364, 31.7178576082],
  province: "湖北省",
  city: "随州市"
}, {id: 249, coords: [114.906618047, 30.4461089379], province: "湖北省", city: "黄冈市"}, {
  id: 250,
  coords: [115.050683164, 30.2161271277],
  province: "湖北省",
  city: "黄石市"
}, {id: 251, coords: [111.996396357, 27.7410733023], province: "湖南省", city: "娄底市"}, {
  id: 252,
  coords: [113.146195519, 29.3780070755],
  province: "湖南省",
  city: "岳阳市"
}, {id: 253, coords: [111.653718137, 29.0121488552], province: "湖南省", city: "常德市"}, {
  id: 254,
  coords: [110.481620157, 29.1248893532],
  province: "湖南省",
  city: "张家界市"
}, {id: 255, coords: [109.986958796, 27.5574829012], province: "湖南省", city: "怀化市"}, {
  id: 256,
  coords: [113.131695341, 27.8274329277],
  province: "湖南省",
  city: "株洲市"
}, {id: 257, coords: [111.614647686, 26.4359716468], province: "湖南省", city: "永州市"}, {
  id: 258,
  coords: [112.935555633, 27.835095053],
  province: "湖南省",
  city: "湘潭市"
}, {id: 259, coords: [109.7457458, 28.3179507937], province: "湖南省", city: "湘西土家族苗族自治州"}, {
  id: 260,
  coords: [112.366546645, 28.5880877799],
  province: "湖南省",
  city: "益阳市"
}, {id: 261, coords: [112.583818811, 26.8981644154], province: "湖南省", city: "衡阳市"}, {
  id: 262,
  coords: [111.461525404, 27.2368112449],
  province: "湖南省",
  city: "邵阳市"
}, {id: 263, coords: [113.037704468, 25.7822639757], province: "湖南省", city: "郴州市"}, {
  id: 264,
  coords: [112.979352788, 28.2134782309],
  province: "湖南省",
  city: "长沙市"
}, {
  id: 266,
  coords: [113.566432335, 22.1950041592],
  province: "澳门特别行政区",
  city: "澳门半岛"
}, {id: 267, coords: [113.557519102, 22.2041179884], province: "澳门特别行政区", city: "澳门"}, {
  id: 268,
  coords: [103.215249178, 35.5985143488],
  province: "甘肃省",
  city: "临夏回族自治州"
}, {id: 269, coords: [103.823305441, 36.064225525], province: "甘肃省", city: "兰州市"}, {
  id: 270,
  coords: [98.2816345853, 39.8023973267],
  province: "甘肃省",
  city: "嘉峪关市"
}, {id: 271, coords: [105.736931623, 34.5843194189], province: "甘肃省", city: "天水市"}, {
  id: 272,
  coords: [104.626637601, 35.5860562418],
  province: "甘肃省",
  city: "定西市"
}, {id: 273, coords: [106.688911157, 35.55011019], province: "甘肃省", city: "平凉市"}, {
  id: 274,
  coords: [107.644227087, 35.7268007545],
  province: "甘肃省",
  city: "庆阳市"
}, {id: 275, coords: [100.459891869, 38.939320297], province: "甘肃省", city: "张掖市"}, {
  id: 276,
  coords: [102.640147343, 37.9331721429],
  province: "甘肃省",
  city: "武威市"
}, {id: 277, coords: [102.917442486, 34.9922111784], province: "甘肃省", city: "甘南藏族自治州"}, {
  id: 278,
  coords: [104.171240904, 36.5466817062],
  province: "甘肃省",
  city: "白银市"
}, {id: 279, coords: [98.5084145062, 39.7414737682], province: "甘肃省", city: "酒泉市"}, {
  id: 280,
  coords: [102.208126263, 38.5160717995],
  province: "甘肃省",
  city: "金昌市"
}, {id: 281, coords: [104.934573406, 33.3944799729], province: "甘肃省", city: "陇南市"}, {
  id: 282,
  coords: [117.642193934, 26.2708352794],
  province: "福建省",
  city: "三明市"
}, {id: 283, coords: [118.181882949, 26.6436264742], province: "福建省", city: "南平市"}, {
  id: 284,
  coords: [118.103886046, 24.4892306125],
  province: "福建省",
  city: "厦门市"
}, {id: 285, coords: [119.54208215, 26.6565274192], province: "福建省", city: "宁德市"}, {
  id: 286,
  coords: [118.600362343, 24.901652384],
  province: "福建省",
  city: "泉州市"
}, {id: 287, coords: [117.676204679, 24.5170647798], province: "福建省", city: "漳州市"}, {
  id: 288,
  coords: [119.330221107, 26.0471254966],
  province: "福建省",
  city: "福州市"
}, {id: 289, coords: [119.077730964, 25.4484501367], province: "福建省", city: "莆田市"}, {
  id: 290,
  coords: [117.017996739, 25.0786854335],
  province: "福建省",
  city: "龙岩市"
}, {id: 291, coords: [91.7506438744, 29.2290269317], province: "西藏自治区", city: "山南"}, {
  id: 292,
  coords: [91.111890896, 29.6625570621],
  province: "西藏自治区",
  city: "拉萨市"
}, {id: 293, coords: [88.8914855677, 29.2690232039], province: "西藏自治区", city: "日喀则"}, {
  id: 294,
  coords: [97.18558158, 31.1405756319],
  province: "西藏自治区",
  city: "昌都"
}, {id: 295, coords: [94.3499854582, 29.6669406258], province: "西藏自治区", city: "林芝"}, {
  id: 296,
  coords: [92.0670183689, 31.4806798301],
  province: "西藏自治区",
  city: "那曲"
}, {id: 297, coords: [81.1076686895, 30.4045565883], province: "西藏自治区", city: "阿里"}, {
  id: 298,
  coords: [104.85208676, 26.5918660603],
  province: "贵州省",
  city: "六盘水市"
}, {id: 299, coords: [105.928269966, 26.2285945777], province: "贵州省", city: "安顺市"}, {
  id: 300,
  coords: [105.333323371, 27.4085621313],
  province: "贵州省",
  city: "毕节市"
}, {id: 301, coords: [106.709177096, 26.6299067414], province: "贵州省", city: "贵阳市"}, {
  id: 302,
  coords: [106.931260316, 27.6999613771],
  province: "贵州省",
  city: "遵义市"
}, {id: 303, coords: [109.168558028, 27.6749026906], province: "贵州省", city: "铜仁市"}, {
  id: 304,
  coords: [107.985352573, 26.5839917665],
  province: "贵州省",
  city: "黔东南苗族侗族自治州"
}, {id: 305, coords: [107.52320511, 26.2645359974], province: "贵州省", city: "黔南布依族苗族自治州"}, {
  id: 306,
  coords: [104.900557798, 25.0951480559],
  province: "贵州省",
  city: "黔西南布依族苗族自治州"
}, {id: 307, coords: [124.338543115, 40.1290228266], province: "辽宁省", city: "丹东市"}, {
  id: 308,
  coords: [121.593477781, 38.9487099383],
  province: "辽宁省",
  city: "大连市"
}, {id: 309, coords: [123.929819767, 41.8773038296], province: "辽宁省", city: "抚顺市"}, {
  id: 310,
  coords: [120.446162703, 41.5718276679],
  province: "辽宁省",
  city: "朝阳市"
}, {id: 311, coords: [123.77806237, 41.3258376266], province: "辽宁省", city: "本溪市"}, {
  id: 312,
  coords: [123.432790922, 41.8086447835],
  province: "辽宁省",
  city: "沈阳市"
}, {id: 313, coords: [122.07322781, 41.141248023], province: "辽宁省", city: "盘锦市"}, {
  id: 314,
  coords: [122.233391371, 40.6686510665],
  province: "辽宁省",
  city: "营口市"
}, {id: 315, coords: [120.860757645, 40.7430298813], province: "辽宁省", city: "葫芦岛市"}, {
  id: 316,
  coords: [123.172451205, 41.2733392656],
  province: "辽宁省",
  city: "辽阳市"
}, {id: 317, coords: [123.854849615, 42.2997570121], province: "辽宁省", city: "铁岭市"}, {
  id: 318,
  coords: [121.147748738, 41.1308788759],
  province: "辽宁省",
  city: "锦州市"
}, {id: 319, coords: [121.660822129, 42.0192501071], province: "辽宁省", city: "阜新市"}, {
  id: 320,
  coords: [123.007763329, 41.1187436822],
  province: "辽宁省",
  city: "鞍山市"
}, {id: 321, coords: [106.530635013, 29.5446061089], province: "重庆", city: "重庆市"}, {
  id: 322,
  coords: [108.707509278, 34.345372996],
  province: "陕西省",
  city: "咸阳市"
}, {id: 323, coords: [109.934208154, 33.8739073951], province: "陕西省", city: "商洛市"}, {
  id: 324,
  coords: [109.038044563, 32.70437045],
  province: "陕西省",
  city: "安康市"
}, {id: 325, coords: [107.170645452, 34.3640808097], province: "陕西省", city: "宝鸡市"}, {
  id: 326,
  coords: [109.500509757, 36.6033203523],
  province: "陕西省",
  city: "延安市"
}, {id: 327, coords: [109.745925744, 38.2794392401], province: "陕西省", city: "榆林市"}, {
  id: 328,
  coords: [107.045477629, 33.0815689782],
  province: "陕西省",
  city: "汉中市"
}, {id: 329, coords: [109.483932697, 34.5023579758], province: "陕西省", city: "渭南市"}, {
  id: 330,
  coords: [108.953098279, 34.2777998978],
  province: "陕西省",
  city: "西安市"
}, {id: 331, coords: [108.968067013, 34.9083676964], province: "陕西省", city: "铜川市"}, {
  id: 332,
  coords: [100.223722769, 34.4804845846],
  province: "青海省",
  city: "果洛藏族自治州"
}, {id: 333, coords: [102.085206987, 36.5176101677], province: "青海省", city: "海东"}, {
  id: 334,
  coords: [100.879802174, 36.9606541011],
  province: "青海省",
  city: "海北藏族自治州"
}, {id: 335, coords: [100.624066094, 36.2843638038], province: "青海省", city: "海南藏族自治州"}, {
  id: 336,
  coords: [97.3426254153, 37.3737990706],
  province: "青海省",
  city: "海西蒙古族藏族自治州"
}, {id: 337, coords: [97.0133161374, 33.0062399097], province: "青海省", city: "玉树藏族自治州"}, {
  id: 338,
  coords: [101.76792099, 36.640738612],
  province: "青海省",
  city: "西宁市"
}, {id: 339, coords: [102.007600308, 35.5228515517], province: "青海省", city: "黄南藏族自治州"}, {
  id: 340,
  coords: [114.173291988, 22.3072458588],
  province: "香港特别行政区",
  city: "九龙"
}, {id: 341, coords: [114.146701965, 22.4274312754], province: "香港特别行政区", city: "新界"}, {
  id: 342,
  coords: [114.183870524, 22.2721034276],
  province: "香港特别行政区",
  city: "香港"
}, {id: 343, coords: [131.019048047, 45.7750053686], province: "黑龙江省", city: "七台河市"}, {
  id: 344,
  coords: [128.910765978, 47.7346850751],
  province: "黑龙江省",
  city: "伊春市"
}, {id: 345, coords: [130.284734586, 46.8137796047], province: "黑龙江省", city: "佳木斯市"}, {
  id: 346,
  coords: [131.17140174, 46.6551020625],
  province: "黑龙江省",
  city: "双鸭山市"
}, {id: 347, coords: [126.657716855, 45.7732246332], province: "黑龙江省", city: "哈尔滨市"}, {
  id: 348,
  coords: [124.19610419, 51.991788968],
  province: "黑龙江省",
  city: "大兴安岭"
}, {id: 349, coords: [125.02183973, 46.59670902], province: "黑龙江省", city: "大庆市"}, {
  id: 350,
  coords: [129.608035396, 44.5885211528],
  province: "黑龙江省",
  city: "牡丹江市"
}, {id: 351, coords: [126.989094572, 46.646063927], province: "黑龙江省", city: "绥化市"}, {
  id: 352,
  coords: [130.941767273, 45.3215398866],
  province: "黑龙江省",
  city: "鸡西市"
}, {id: 353, coords: [130.292472051, 47.3386659037], province: "黑龙江省", city: "鹤岗市"}, {
  id: 354,
  coords: [127.500830295, 50.2506900907],
  province: "黑龙江省",
  city: "黑河市"
}, {id: 355, coords: [123.987288942, 47.3476998134], province: "黑龙江省", city: "齐齐哈尔市"}];

let geoCoordMap = {};
for (let i = 0; i < cities.length; i++) {
  let city = cities[i];
  let name = city.city;
  if (name.indexOf('市') >= 0) {
    name = name.replace('市', '');
  }
  geoCoordMap[name] = city.coords;
}

let provinceCapitals = [
  {
    id: 199,
    coords: [114.522081844, 38.0489583146],
    province: "河北",
    city: "石家庄市"
  },
  {
    id: 111,
    coords: [112.550863589, 37.890277054],
    province: "山西",
    city: "太原市"
  },
  {
    id: 312,
    coords: [123.432790922, 41.8086447835],
    province: "辽宁",
    city: "沈阳市"
  },
  {
    id: 47,
    coords: [125.313642427, 43.8983376071],
    province: "吉林",
    city: "长春市"
  },
  {
    id: 347,
    coords: [126.657716855, 45.7732246332],
    province: "黑龙江",
    city: "哈尔滨市"
  },
  {
    id: 169,
    coords: [118.778074408, 32.0572355018],
    province: "江苏",
    city: "南京市"
  },
  {
    id: 226,
    coords: [120.219375416, 30.2592444615],
    province: "浙江",
    city: "杭州市"
  },
  {
    id: 77,
    coords: [117.282699092, 31.8669422607],
    province: "安徽",
    city: "合肥市"
  },
  {
    id: 288,
    coords: [119.330221107, 26.0471254966],
    province: "福建",
    city: "福州市"
  },
  {
    id: 184,
    coords: [115.893527546, 28.6895780001],
    province: "江西",
    city: "南昌市"
  },
  {
    id: 98,
    coords: [117.024967066, 36.6827847272],
    province: "山东",
    city: "济南市"
  },
  {
    id: 219,
    coords: [113.64964385, 34.7566100641],
    province: "河南",
    city: "郑州市"
  },
  {
    id: 242,
    coords: [114.316200103, 30.5810841269],
    province: "湖北",
    city: "武汉市"
  },
  {
    id: 264,
    coords: [112.979352788, 28.2134782309],
    province: "湖南",
    city: "长沙市"
  },
  {
    id: 123,
    coords: [113.307649675, 23.1200491021],
    province: "广东",
    city: "广州市"
  },
  {
    id: 235,
    coords: [110.330801848, 20.022071277],
    province: "海南",
    city: "海口市"
  },
  {
    id: 57,
    coords: [104.067923463, 30.6799428454],
    province: "四川",
    city: "成都市"
  },
  {
    id: 301,
    coords: [106.709177096, 26.6299067414],
    province: "贵州",
    city: "贵阳市"
  },
  {
    id: 9,
    coords: [102.714601139, 25.0491531005],
    province: "云南",
    city: "昆明市"
  },
  {
    id: 330,
    coords: [108.953098279, 34.2777998978],
    province: "陕西",
    city: "西安市"
  },
  {
    id: 269,
    coords: [103.823305441, 36.064225525],
    province: "甘肃",
    city: "兰州市"
  },
  {
    id: 338,
    coords: [101.76792099, 36.640738612],
    province: "青海",
    city: "西宁市"
  },
  {
    id: 292,
    coords: [91.111890896, 29.6625570621],
    province: "西藏",
    city: "拉萨市"
  },
  {
    id: 141,
    coords: [108.297233556, 22.8064929356],
    province: "广西",
    city: "南宁市"
  },
  {
    id: 23,
    coords: [111.66035052, 40.8283188731],
    province: "内蒙古",
    city: "呼和浩特市"
  },
  {
    id: 74,
    coords: [106.206478608, 38.5026210119],
    province: "宁夏",
    city: "银川市"
  },
  {
    id: 154,
    coords: [87.5649877411, 43.8403803472],
    province: "新疆",
    city: "乌鲁木齐市"
  },
  {
    id: 32,
    coords: [114.130474436, 22.3748329286],
    province: "台湾",
    city: "台北市"
  },
  {province: "日本", coords: [139.69, 35.68]},
  {province:"阿富汗", coords:[69.11,34.28]},
  {province:"阿尔巴尼亚", coords:[19.49,41.18]},
  {province:"阿尔及利亚", coords:[3.08,36.42]},
  {province:"美属萨摩亚", coords:[-170.43,-14.16]},
  {province:"安哥拉", coords:[13.15,-8.50]},
  {province:"安提瓜和巴布达", coords:[-61.48,17.20]},
  {province:"阿根廷", coords:[-60.00,-36.30]},
  {province:"亚美尼亚", coords:[44.31,40.10]},
  {province:"阿鲁巴", coords:[-70.02,12.32]},
  {province:"澳大利亚", coords:[149.08,-35.15]},
  {province:"奥地利", coords:[16.22,48.12]},
  {province:"阿塞拜疆", coords:[49.56,40.29]},
  {province:"巴哈马", coords:[-77.20,25.05]},
  {province:"巴林", coords:[50.30,26.10]},
  {province:"孟加拉国", coords:[90.26,23.43]},
  {province:"巴巴多斯", coords:[-59.30,13.05]},
  {province:"白俄罗斯", coords:[27.30,53.52]},
  {province:"比利时", coords:[4.21,50.51]},
  {province:"伯利兹", coords:[-88.30,17.18]},
  {province:"贝宁", coords:[2.42,6.23]},
  {province:"不丹", coords:[89.45,27.31]},
  {province:"玻利维亚", coords:[-68.10,-16.20]},
  {province:"波斯尼亚和黑塞哥维那", coords:[18.26,43.52]},
  {province:"博茨瓦纳", coords:[25.57,-24.45]},
  {province:"巴西", coords:[-47.55,-15.47]},
  {province:"英属维尔京群岛", coords:[-64.37,18.27]},
  {province:"文莱", coords:[115.00,4.52]},
  {province:"保加利亚", coords:[23.20,42.45]},
  {province:"布基纳法索", coords:[-1.30,12.15]},
  {province:"布隆迪", coords:[29.18,-3.16]},
  {province:"柬埔寨", coords:[104.55,11.33]},
  {province:"喀麦隆", coords:[11.35,3.50]},
  {province:"加拿大", coords:[-75.42,45.27]},
  {province:"佛得角", coords:[-23.34,15.02]},
  {province:"开曼群岛", coords:[-81.24,19.20]},
  {province:"中非共和国", coords:[18.35,4.23]},
  {province:"乍得", coords:[14.59,12.10]},
  {province:"智利", coords:[-70.40,-33.24]},
  {province:"中国", coords:[116.20,39.55]},
  {province:"哥伦比亚", coords:[-74.00,4.34]},
  {province:"科摩罗", coords:[43.16,-11.40]},
  {province:"刚果", coords:[15.12,-4.09]},
  {province:"哥斯达黎加", coords:[-84.02,9.55]},
  {province:"科特迪瓦", coords:[-5.17,6.49]},
  {province:"克罗地亚", coords:[15.58,45.50]},
  {province:"古巴", coords:[-82.22,23.08]},
  {province:"塞浦路斯", coords:[33.25,35.10]},
  {province:"捷克共和国", coords:[14.22,50.05]},
  {province:"朝鲜", coords:[125.30,39.09]},
  {province:"刚果(扎伊尔)", coords:[15.15,-4.20]},
  {province:"丹麦", coords:[12.34,55.41]},
  {province:"吉布提", coords:[42.20,11.08]},
  {province:"多米尼加", coords:[-61.24,15.20]},
  {province:"多米尼加共和国", coords:[-69.59,18.30]},
  {province:"东帝汶", coords:[125.34,-8.29]},
  {province:"厄瓜多尔", coords:[-78.35,-0.15]},
  {province:"埃及", coords:[31.14,30.01]},
  {province:"萨尔瓦多", coords:[-89.10,13.40]},
  {province:"赤道几内亚", coords:[8.50,3.45]},
  {province:"厄立特里亚", coords:[38.55,15.19]},
  {province:"爱沙尼亚", coords:[24.48,59.22]},
  {province:"埃塞俄比亚", coords:[38.42,9.02]},
  {province:"福克兰群岛(马尔维纳斯群岛)", coords:[-59.51,-51.40]},
  {province:"法罗群岛", coords:[-6.56,62.05]},
  {province:"斐济", coords:[178.30,-18.06]},
  {province:"芬兰", coords:[25.03,60.15]},
  {province:"法国", coords:[2.20,48.50]},
  {province:"法属圭亚那", coords:[-52.18,5.05]},
  {province:"法属波利尼西亚", coords:[-149.34,-17.32]},
  {province:"加蓬", coords:[9.26,0.25]},
  {province:"冈比亚", coords:[-16.40,13.28]},
  {province:"格鲁吉亚", coords:[44.50,41.43]},
  {province:"德国", coords:[13.25,52.30]},
  {province:"加纳", coords:[-0.06,5.35]},
  {province:"希腊", coords:[23.46,37.58]},
  {province:"格陵兰", coords:[-51.35,64.10]},
  {province:"瓜德罗普岛", coords:[-61.44,16.00]},
  {province:"危地马拉", coords:[-90.22,14.40]},
  {province:"根西岛", coords:[-2.33,49.26]},
  {province:"几内亚", coords:[-13.49,9.29]},
  {province:"几内亚比绍", coords:[-15.45,11.45]},
  {province:"圭亚那", coords:[-58.12,6.50]},
  {province:"海地", coords:[-72.20,18.40]},
  {province:"赫德岛和麦当劳群岛", coords:[74.00,-53.00]},
  {province:"洪都拉斯", coords:[-87.14,14.05]},
  {province:"匈牙利", coords:[19.05,47.29]},
  {province:"冰岛", coords:[-21.57,64.10]},
  {province:"印度", coords:[77.13,28.37]},
  {province:"印度尼西亚", coords:[106.49,-6.09]},
  {province:"伊朗", coords:[51.30,35.44]},
  {province:"伊拉克", coords:[44.30,33.20]},
  {province:"爱尔兰", coords:[-6.15,53.21]},
  {province:"以色列", coords:[35.12,31.47]},
  {province:"意大利", coords:[12.29,41.54]},
  {province:"牙买加", coords:[-76.50,18.00]},
  {province:"约旦", coords:[35.52,31.57]},
  {province:"哈萨克斯坦", coords:[71.30,51.10]},
  {province:"肯尼亚", coords:[36.48,-1.17]},
  {province:"基里巴斯", coords:[173.00,1.30]},
  {province:"科威特", coords:[48.00,29.30]},
  {province:"吉尔吉斯斯坦", coords:[74.46,42.54]},
  {province:"老挝", coords:[102.36,17.58]},
  {province:"拉脱维亚", coords:[24.08,56.53]},
  {province:"黎巴嫩", coords:[35.31,33.53]},
  {province:"莱索托", coords:[27.30,-29.18]},
  {province:"利比里亚", coords:[-10.47,6.18]},
  {province:"阿拉伯利比亚民众国", coords:[13.07,32.49]},
  {province:"列支敦士登", coords:[9.31,47.08]},
  {province:"立陶宛", coords:[25.19,54.38]},
  {province:"卢森堡", coords:[6.09,49.37]},
  {province:"马达加斯加", coords:[47.31,-18.55]},
  {province:"马拉维", coords:[33.48,-14.00]},
  {province:"马来西亚", coords:[101.41,3.09]},
  {province:"马尔代夫", coords:[73.28,4.00]},
  {province:"马里", coords:[-7.55,12.34]},
  {province:"马耳他", coords:[14.31,35.54]},
  {province:"马提尼克岛", coords:[-61.02,14.36]},
  {province:"毛里塔尼亚", coords:[57.30,-20.10]},
  {province:"马约特岛", coords:[45.14,-12.48]},
  {province:"墨西哥", coords:[-99.10,19.20]},
  {province:"密克罗尼西亚(联邦) ", coords:[158.09,6.55]},
  {province:"摩尔多瓦共和国", coords:[28.50,47.02]},
  {province:"莫桑比克", coords:[32.32,-25.58]},
  {province:"缅甸", coords:[96.20,16.45]},
  {province:"纳米比亚", coords:[17.04,-22.35]},
  {province:"尼泊尔", coords:[85.20,27.45]},
  {province:"荷兰", coords:[4.54,52.23]},
  {province:"荷属安的列斯", coords:[-69.00,12.05]},
  {province:"新喀里多尼亚", coords:[166.30,-22.17]},
  {province:"新西兰", coords:[174.46,-41.19]},
  {province:"尼加拉瓜", coords:[-86.20,12.06]},
  {province:"尼日尔", coords:[2.06,13.27]},
  {province:"尼日利亚", coords:[7.32,9.05]},
  {province:"诺福克岛", coords:[168.43,-45.20]},
  {province:"北马里亚纳群岛", coords:[145.45,15.12]},
  {province:"挪威", coords:[10.45,59.55]},
  {province:"阿曼", coords:[58.36,23.37]},
  {province:"巴基斯坦", coords:[73.10,33.40]},
  {province:"帕劳", coords:[134.28,7.20]},
  {province:"巴拿马", coords:[-79.25,9.00]},
  {province:"巴布亚新几内亚", coords:[147.08,-9.24]},
  {province:"巴拉圭", coords:[-57.30,-25.10]},
  {province:"秘鲁", coords:[-77.00,-12.00]},
  {province:"菲律宾", coords:[121.03,14.40]},
  {province:"波兰", coords:[21.00,52.13]},
  {province:"葡萄牙", coords:[-9.10,38.42]},
  {province:"波多黎各", coords:[-66.07,18.28]},
  {province:"卡塔尔", coords:[51.35,25.15]},
  {province:"韩国", coords:[126.58,37.31]},
  {province:"罗马尼亚", coords:[26.10,44.27]},
  {province:"俄罗斯", coords:[37.35,55.45]},
  {province:"卢旺达", coords:[30.04,-1.59]},
  {province:"圣基茨和尼维斯", coords:[-62.43,17.17]},
  {province:"圣卢西亚", coords:[-60.58,14.02]},
  {province:"圣皮埃尔和密克隆", coords:[-56.12,46.46]},
  {province:"圣文森特和格林纳丁斯", coords:[-61.10,13.10]},
  {province:"萨摩亚", coords:[-171.50,-13.50]},
  {province:"圣马力诺", coords:[12.30,43.55]},
  {province:"圣多美和普林西比", coords:[6.39,0.10]},
  {province:"沙特阿拉伯", coords:[46.42,24.41]},
  {province:"塞内加尔", coords:[-17.29,14.34]},
  {province:"塞拉利昂", coords:[-13.17,8.30]},
  {province:"斯洛伐克", coords:[17.07,48.10]},
  {province:"斯洛文尼亚", coords:[14.33,46.04]},
  {province:"所罗门群岛", coords:[159.57,-9.27]},
  {province:"索马里", coords:[45.25,2.02]},
  {province:"比勒陀利亚", coords:[28.12,-25.44]},
  {province:"西班牙", coords:[-3.45,40.25]},
  {province:"苏丹", coords:[32.35,15.31]},
  {province:"苏里南", coords:[-55.10,5.50]},
  {province:"斯威士兰", coords:[31.06,-26.18]},
  {province:"瑞典", coords:[18.03,59.20]},
  {province:"瑞士", coords:[7.28,46.57]},
  {province:"阿拉伯叙利亚共和国", coords:[36.18,33.30]},
  {province:"塔吉克斯坦", coords:[68.48,38.33]},
  {province:"泰国", coords:[100.35,13.45]},
  {province:"马其顿", coords:[21.26,42.01]},
  {province:"多哥", coords:[1.20,6.09]},
  {province:"汤加", coords:[-174.00,-21.10]},
  {province:"突尼斯", coords:[10.11,36.50]},
  {province:"土耳其", coords:[32.54,39.57]},
  {province:"土库曼斯坦", coords:[57.50,38.00]},
  {province:"图瓦卢", coords:[179.13,-8.31]},
  {province:"乌干达", coords:[32.30,0.20]},
  {province:"乌克兰", coords:[30.28,50.30]},
  {province:"阿联酋", coords:[54.22,24.28]},
  {province:"英国", coords:[-0.05,51.36]},
  {province:"坦桑尼亚", coords:[35.45,-6.08]},
  {province:"美国", coords:[-77.02,39.91]},
  {province:"美属维尔京群岛", coords:[-64.56,18.21]},
  {province:"乌拉圭", coords:[-56.11,-34.50]},
  {province:"乌兹别克斯坦", coords:[69.10,41.20]},
  {province:"瓦努阿图", coords:[168.18,-17.45]},
  {province:"委内瑞拉", coords:[-66.55,10.30]},
  {province:"越南", coords:[105.55,21.05]},
  {province:"南斯拉夫", coords:[20.37,44.50]},
  {province:"赞比亚", coords:[28.16,-15.28]},
  {province:"津巴布韦", coords:[31.02,-17.43]}
];
for (let i = 0; i < provinceCapitals.length; i++) {
  let capital = provinceCapitals[i];
  let name = capital.province;
  geoCoordMap[name] = capital.coords;
}

export default geoCoordMap;
